/*Задача 2 - От 1 до потребителя*/

/*Във файл, който се казва `count_to_user.py`, напишете програма, която:*/

/*1. Чете от потребителя 1 число - `n`.*/
/*2. Принтира всички числя от 1 до `n`*/
/*3. След което принтира всички числа от `n` до 1*/
/*4. Всяко принтиране да е на нов ред.*/

/*Примери:*/

/*```*/
/*Enter number: 6*/
/*1*/
/*2*/
/*3*/
/*4*/
/*5*/
/*6*/
/*```*/

#include <stdio.h>
main()
{
	int number;
	int i;
	
	printf("Enter number: ");
	scanf("%d", &number);
	
	for (i = 1; i <= number; i++) {
		printf("%d\n", i);
	}
}
