/*Задача 5 - Изпринтете цифрите на 1 число, започвайки от последната*/

/*Във файл `print_digits.py`, напишете програма, която:*/

/** Чете от потребителя 1 цяло число `n`*/
/** На екрана, по 1 цифра на ред, изкарва всяка цифра на `n`, започвайки от последната*/

/*Например:*/

/*```*/
/*Enter number: 1234567*/
/*7*/
/*6*/
/*5*/
/*4*/
/*3*/
/*2*/
/*1*/
/*```*/

/***Подсказка***/

/*Какво ще стане, ако разделите **целочислено** едно число на 10?*/

#include <stdio.h>

main()
{
	int number;
	int digit;
	
	printf("\nEnter number: ");
	scanf("%d", &number);
	
	while (number != 0) {
		digit = number % 10;
		
		printf("\n%d\n\n", digit);
		
		number = number / 10;
	}
}
