/*20. Дадено ни е училище. В училището имаме класове и ученици. Всеки*/
/*клас има множество от преподаватели. Всеки преподавател има мно-*/
/*жество от дисциплини, по които преподава. Учениците имат име и*/
/*уникален номер в класа. Класовете имат уникален текстов иден-*/
/*тификатор. Дисциплините имат име, брой уроци и брой упражнения.*/

/*Задачата е да се моделира училище с Java класове. Трябва да*/
/*декларирате класове заедно с техните полета, свойства, методи и*/
/*конструктори. Дефинирайте и тестов клас, който демонстрира, че*/
/*останалите класове работят коректно.*/
